wambd/certification1/availabilityRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pac="http://packages.servicePackage.dome.com/">
<soapenv:Header/>
<soapenv:Body>
   <pac:availability>
      <arg0>
       <!--El campo "BeginDate" es obligatorio-->
         <beginDate>2020-03-14</beginDate>
       <!--endDate>2019-02-02</endDate-->
         <categoryCode>T</categoryCode>
         <!--El campo "distribution" es obligatorio -->
         <distribution>
            <distributionId>1</distributionId>
            <pax>
               <age>30</age>
               <documentNumber></documentNumber>
               <firstName>NOMBRETESTA1</firstName>
               <lastName>APELLIDOTESTA1</lastName>
               <paxId>1</paxId>
               <phone></phone>
            </pax>
            <pax>
               <age>35</age>
               <documentNumber></documentNumber>
               <firstName>NOMBRETESTA2</firstName>
               <lastName>APELLIDOTESTA2</lastName>
               <paxId>2</paxId>
               <phone></phone>
            </pax> 
            <pax>
               <age>5</age>
               <documentNumber></documentNumber>
               <firstName>NOMBRETESTA3</firstName>
               <lastName>APELLIDOTESTA3</lastName>
               <paxId>3</paxId>
               <phone></phone>
            </pax>   
         </distribution>
         <!-- El campo "fareCode" es obligatorio -->
         <fareCode>NORMAL</fareCode>
         <!--ideses></ideses-->
         <login>
            <clientId>WWCTM001</clientId>
            <password>CT8954TO</password>
            <system>WAW</system>
            <user>XMLCON</user>
         </login>
         <!-- El campo "packageCode" es obligatorio -->
         <packageCode>IT19T-27819</packageCode>
         <showOptionals>Y</showOptionals>
         <stayCode>7</stayCode>
      </arg0>
   </pac:availability>
</soapenv:Body>
</soapenv:Envelope>